<!DOCTYPE html>

<html>
<head>
	<meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
</head>
<body>

<?php

$id = $_GET['id'];

$vyakhyaCode = array("1"=>"BM","2"=>"NN","3"=>"PP","4"=>"RP");
$vyakhyaName = array("BM"=>"भामति","NN"=>"न्यायनिर्णय","PP"=>"पञ्चपादिक","RP"=>"रत्नप्रभ");

foreach ($vyakhyaCode as $vk) {
	if (file_exists('vyakhya/' . $vk . '.xml')) {
    	$xml = simplexml_load_file('vyakhya/' . $vk . '.xml');

    	foreach ($xml->xpath('div[@id="' . $id . '"]') as $div) {
    		echo '<div class="VyakhyaDescriptor" id="' . $div['id'] . '">';
 			foreach ($div->p as $p) {
	 			echo '<p class="' . $p['class'] . '">' . $p . '</p>';
 			}
 			echo '</div>';
		}
   	}
}

?>

<ul>
    <li><a class="showvyakhya" data-vyakhya="BM" data-parent="sel_<?=$id?>">भामति</a></li>
    <li><a class="showvyakhya" data-vyakhya="NN" data-parent="sel_<?=$id?>">न्यायनिर्णय</a></li>
    <li><a class="showvyakhya" data-vyakhya="PP" data-parent="sel_<?=$id?>">पञ्चपादिक</a></li>
    <li><a class="showvyakhya" data-vyakhya="RP" data-parent="sel_<?=$id?>">रत्नप्रभ</a></li>
</ul>
</body>
</html>

<div class="VyakhyaDescriptor" id="BS_C01_S01_I01_W01_NN">
	<p class="Avataranika">अथ यदसंदिग्धमपिरयोजनं च न तत्प्रेक्षावत्प्रतिपित्सागोचरः, यथा समनस्केन्द्रिय संनिकृष्टः स्फीतालोकमध्यवर्ती घटः, करटदन्ता वा ॑ तथा चेदं ब्रब्मेति व्यापकविरुद्धोपलब्धिः । तथा हि बृहत्त्वाद्बृंहणत्वाद्वात्मैव ब्रह्मेति गीयते । स चायमाकीटपतङ्गेभ्य आ च देवर्षिभ्यः प्राणभृन्मात्रस्येदङ्कारास्पदेभ्यो देहेन्द्रियमनोबुद्धिविषयेभ्यो विवेकेन ’अह’ इत्यसंदिग्धाविपर्यस्तापरोक्षानुभवसिद्ध इति न जिज्ञासारपदम् । न हि जातु कश्चिदत्र संदिग्धेऽअहं वा नाहं वा इति । न च विपर्यस्यति ‘नाहमेव’ इति । न च ‘अहं कृशः, स्थूलः, गच्छामि’ इत्यादिदेहधर्मसामानाधिकरण्यदर्शनाद्देहालम्बनोऽयमहङ्कार इति सांप्रतम् । तदालम्बनत्वे हि ‘योऽहं बाल्ये पितरावन्वभूवं स एव स्थाविरे प्रणप्तॄननुभवामि’ इति प्रतिसंधानं न भवेत् । न हि बालस्थविरयोः शरीरयोरस्ति मनागपि प्रत्यभिज्ञानगन्धो येनैकत्वमध्यवसीयेत । तस्माद्येषु व्यावर्तमानेषु यदनुवर्तते तत्तेभ्यो भिन्नं यथा कुसुमेभ्यः सूत्रम् । तथा च बालादिशरीरेषु व्यावर्तमानेष्वपि परस्परमहङ्कारास्पदमनुवर्तमानं तेभ्यो भिद्यते । अपि च स्वप्नान्ते दिव्यं शरीरभेदमास्थाय तदुचितान्भोगान्भुञ्जान एव प्रतिबुद्धो मनुष्यशरीरमात्मानं पश्यन् ‘नाहं देवो मनुष्य एव’ इति देवषशरीरे बाध्यमानेऽप्यहमास्पदमबाध्यमानं शरीराद्भिन्नं प्रतिपद्यते । अपि च योगव्याघ्रः शरीरभेदेऽप्यात्मानमभिन्नमनुभवतीति नाहङ्कारालम्बनं देहः । अत एव नेन्द्रियाण्यप्यस्यालम्बनम्, इन्द्रियभेदेऽपि ‘योऽहमद्राक्षं स एवैतर्हि स्पृशामि’ इत्यहमालम्बनस्य प्रत्यभिज्ञानात् । विषयेभ्यस्त्वस्य विवेकः स्थवीयानेव । बुद्धिमनसोश्च करणयोः ‘अहम्’ इति कर्तृप्रतिभासप्रख्यानालम्बनत्वायोगः । ‘कृशोऽहम्’ अन्धोऽहम्’ इत्यादयस्तु प्रयोगा असत्यप्यभेदे कथञ्चित् ‘मञ्चाः क्रोशन्ति’ इत्यादिवदौपचारिका इति युक्तमुत्पश्यामः । तस्मादिदङ्कारास्पदेभ्यो देहेन्द्रियमनोबुद्धिविषयेभ्यो व्यावृत्तः स्फुटतराहमनुभवगम्य आत्मा संशयाभावादजिज्ञास्य इति सिद्धम् । अप्रयोजनत्वाच्च । तथा हि संसारनिवृत्तिरपवर्ग इह प्रयोजनं विवक्षितम् । संसारश्च आत्मयाथात्म्याननुभवनिमित्त आत्मयाथात्म्यज्ञानेन निवर्तनीयः । स चेदयमनादिरनादिना आत्मयाथात्म्यज्ञानेन सहानुवर्तते, कुतोऽस्य निवृत्तिः अविरोधात्? कुतश्चात्मयाथात्म्याननुभवः ? न हि ‘अहम्’ इत्यनुभवादन्यदात्मयाथात्म्यज्ञानमस्ति । न च ‘अहम्’ इति सर्वजनीनस्फुटतरानुभवसमर्थित आत्मा देहेन्द्रियादिव्यतिरिक्तः शक्य उपनिषदां सहस्रैरप्यन्यथयितुम्, अनुभवविरोधात् । न ह्यागमाः सहस्रमपि घटं पटयितुमीशते । तस्मादनुभवविरोधादुपचरितार्था एवोपनिषद इति युक्तमुत्पश्याम इत्याशयवानाशङ्क्य परिहरति - </p>
    <p class="prateeka">युष्मदस्मत्प्रत्ययगोचरयोः इति । </p>
    <p class="Vyakhya">अत्र च युष्मदस्मदित्यादिः मिथ्येति भवितुं युक्तमित्यन्तः शङ्काग्रन्थः । तथापि इत्यादिः परिहारग्रन्थः । तथापि इत्यभिसंबन्धाच्छङ्कायां यद्यपीति पठितव्यम् । इदमस्मत्प्रत्ययगोचरयोरिति वक्तव्ये युष्मद्ग्रहणमत्यन्तभेदोपलक्षणार्थम् । यथा ह्यहङ्कारप्रतियोगी त्वङ्कारो नैवमिदङ्कारः,’एते वयम्, इमे वयम्, आस्महे’ इति बहुलं प्रयोगदर्शनादिति । चित्स्वभाव आत्मा विषयी, जडस्वभावा बुद्धीन्द्रियदेहविषया विषयाः । एते हि चिदात्मानं विसिन्वन्ति अवबध्नन्ति । स्वेन रूपेण निरूपणीयं कुर्वन्तीति यावत् । परस्परानध्यासहेतौ अत्यन्तवैलक्षण्ये दृष्टान्तः  तमः प्रकाशवदिति । </p>
</div>
    